# -*- coding: utf-8; mode: Python -*-
import unittest
import i18n

class i18n_ru_generic_test(unittest.TestCase):
    def setUp(self):
        self.r = i18n.i18n_ru_generic('ru', '')

    def test_readable_street(self):
        conversions = [
            (u"улица Ленина", u"Ленина, улица"),
            (u"Улица Ленина", u"Ленина, улица"),
            (u"Зеленая улица", u"Зеленая улица"),
            (u"1-ый пер. Дзержинского", u"Дзержинского, переулок 1-ый"),
            (u"1-ый переулок Дзержинского", u"Дзержинского, переулок 1-ый"),
            (u"Красный 5-й пр-д", u"Красный 5-й проезд"),
            (u"Красный 5-ый пр-д.", u"Красный 5-ый проезд"),
            (u"1-й Барьерный переулок", u"Барьерный переулок, 1-й"),
            (u"переулок К.Цеткин", u"К.Цеткин, переулок"),
            (u" переулок К.Цеткин  ", u"К.Цеткин, переулок"),
            (u" переулок      К.Цеткин  ", u"К.Цеткин, переулок"),
            (u"2-й Лётный переулок", u"Лётный переулок, 2-й"),
            (u"2-й Малаховский проезд", u"Малаховский проезд, 2-й"),
            (u"2-й Малаховский пр-д", u"Малаховский проезд, 2-й"),
            (u"Житный переулок", u"Житный переулок"),
            (u"10-я Текстильная улица", u"Текстильная улица, 10-я"),
            (u"11-я линия В.О.", u"В.О., линия 11-я"),

            # Not yet implemented:
            #(u'Малая Пушкарская улица', u'Пушкарская малая, улица'),

            # special case - no name, only prefix
            (u"10-я аллея", u"10-я аллея"),
            (u"123-я улица", u"123-я улица"),
        ]
        for fr, to in conversions:
            self.assertEqual(to, self.r.user_readable_street(fr))

if __name__ == '__main__':
    unittest.main()
